Repository: umap-project/umap
Catalog: umap/locale/*/LC_MESSAGES/django.po
Languages: et, fi

source: Create a map
et: Loo kaart
fi: Luo uusi kartta

source: My maps
et: Minu kaardid
fi: Omat kartat

source: Log in
et: Logi sisse
fi: Kirjaudu palveluun

source: Sign in
et: Loo konto
fi: Kirjaudu palveluun

source: Log out
et: Logi välja
fi: Kirjaudu ulos palvelusta

source: Search maps
et: Otsi kaarte
fi: Etsi karttoja

source: Search
et: Otsi
fi: Etsi

source: Secret edit link is %s
et: Salajane muutmislink on %s
fi: Salainen muokkauslinkki on %s

source: Everyone can edit
et: Igaüks saab muuta
fi: Kuka tahansa saa muokata

source: Only editable with secret edit link
et: Muudetav ainult salajase muutmislingiga
fi: Muokattavissa vain salaisella muokkauslinkillä

source: Site is readonly for maintenance
et: Sait on hoolduseks kirjutuskaitstud

source: name
et: nimi
fi: nimi

source: details
et: detailid
fi: tarkemmat tiedot

source: Link to a page where the licence is detailed.
et: Link litsentsi selgitavale lehele.
fi: Linkki sivulle, jossa lisenssi on määritetty yksityiskohtaisesti.

source: Only editors can edit
et: Ainult toimetajad saavad muuta
fi: Vain julkaisijat saavat muokata

source: Only owner can edit
et: Ainult omanik saab muuta
fi: Vain omistaja saa muokata

source: everyone (public)
et: igaüks (avalik)
fi: kaikille (julkinen)

source: anyone with link
et: kõik, kellel on link
fi: linkinhaltijoille

source: editors only
et: ainult toimetajad
fi: vain muokkaajille

source: blocked
et: blokeeritud

source: description
et: kirjeldus
fi: kuvaus

source: center
et: tsentreeri
fi: keskitä

source: zoom
et: suurenda
fi: zoomaa

source: locate
et: määra asukoht
fi: paikanna

source: Locate user on load?
et: Määra kasutaja asukoht laadimisel?
fi: Paikanna käyttäjä sivua ladattaessa?

source: Choose the map licence.
et: Vali kaardi litsents.
fi: Valitse kartan lisenssi

source: licence
et: litsents
fi: lisenssi

source: owner
et: omanik
fi: omistaja

source: editors
et: toimetajad
fi: julkaisija

source: edit status
et: muutmise staatus
fi: muokkaa tilaa

source: share status
et: jagamise staatus
fi: jaa status

source: settings
et: seaded
fi: asetukset

source: Clone of
et: Koopia
fi: Kloonattu kartasta

source: display on load
et: kuva laadimisel
fi: näytä ladattaessa

source: Display this layer on load.
et: Kuva seda kihti laadimisel
fi: Näytä tämä kerros ladattaessa.

source: Take me to the home page
et: Vii mind avalehele

source: Browse %(current_user)s's maps
et: Sirvi kasutaja %(current_user)s kaarte
fi: Selaa %(current_user)s:n karttoja

source: %(current_user)s has no maps.
et: Kasutajal %(current_user)s pole kaarte.

source: Please log in with your account
et: Logi palun oma kontoga sisse

source: Username
et: Kasutajanimi

source: Password
et: Salasõna

source: Login
et: Logi sisse

source: Please choose a provider
et: Vali palun teenusepakkuja
fi: Valitse mieleisesi palveluntarjoaja

source: uMap lets you create maps with <a href="%(osm_url)s" />OpenStreetMap</a> layers in a minute and embed them in your site.
et: uMap võimaldab sul hetkega luua <a href="%(osm_url)s" />OpenStreetMap</a> kihtidega kaarte ja manustada neid oma saidil.

source: Choose the layers of your map
et: Vali oma kaardile kihid
fi: Valitse karttaasi sopivat taustakartat ja data-kerrokset

source: Add POIs: markers, lines, polygons...
et: Lisa POId: markerid, jooned, hulknurgad...
fi: Lisää tarvittavat POIt: karttamerkkejä, viivoja, monikulmioita...

source: Manage POIs colours and icons
et: Halda POIde värve ja ikoone
fi: Valitse ja hallinnoi POI-merkintöjen värit ja karttakuvakkeet

source: Manage map options: display a minimap, locate user on load…
et: Halda kaardi suvandeid: kuva minikaart, määra laadimisel kasutaja asukoht...
fi: Hallitse kartta-optiot: näytä mini-kartta, paikanna käyttäjä sivun latauksessa, ...

source: Batch import geostructured data (geojson, gpx, kml, osm...)
et: Geostruktureeritud andmete hulgiimport (geojson, gpx, kml, osm...)
fi: Geostrukturoidun datan (geojson, gpx, kml, osm...) tuonti eräajona

source: Choose the license for your data
et: Vali oma andmetele litsents
fi: Valitse tiedoillesi lisenssi

source: Embed and share your map
et: Manusta ja jaga oma kaarti
fi: Jaa karttasi muille ja/tai liitä se muihin sivustoihin

source: And it's <a href="%(repo_url)s">open source</a>!
et: Ja see kõik on <a href="%(repo_url)s">avatud lähtekoodiga</a>!
fi: <a href="%(repo_url)s">Avoin lähdekoodi</a> rulettaa!

source: Play with the demo
et: Mängi demoga
fi: Tongi demoa sielusi kyllyydestä!

source: Map of the uMaps
et: uMaps'i kaart
fi: Kartta uMapeista

source: Get inspired, browse maps
et: Sirvi kaarte ja ammuta inspiratsiooni
fi: Inspiroidu selaamalla karttoja

source: You are logged in. Continuing...
et: Oled sisse logitud. Jätkamine...
fi: Sisäänkirjautumisesi onnistui. Jatketahan...

source: by
et: kasutajalt
fi: taholta

source: More
et: Rohkem
fi: Lisää

source: About
et: Teave
fi: Tietoja

source: Feedback
et: Tagasiside
fi: Palaute

source: Change password
et: Muuda salasõna

source: Password change
et: Salasõna vahetamine

source: Please enter your old password, for security's sake, and then enter your new password twice so we can verify you typed it in correctly.
et: Sisesta palun oma vana salasõna, seejärel kaks korda uus salasõna.

source: Old password
et: Vana salasõna

source: New password
et: Uus salasõna

source: New password confirmation
et: Uue salasõna kinnitamine

source: Change my password
et: Muuda salasõna

source: Password change successful
et: Salasõna vahetamine õnnestus

source: Your password was changed.
et: Sinu salasõna on muudetud.

source: Not map found.
et: Kaarti ei leitud.
fi: Karttaa ei löytynyt.

source: View the map
et: Vaata kaarti
fi: Katso karttaa

source: Your map has been created! If you want to edit this map from another computer, please use this link: %(anonymous_url)s
et: Sinu kaart on loodud! Kui soovid oma kaarti muuta teisest arvutist, kasuta palun seda linki: %(anonymous_url)s
fi: Karttasi on luotu! Jos haluat muokata tätä karttaa joltain muulta tietokoneelta, käytä tätä linkkiä: %(anonymous_url)s

source: Congratulations, your map has been created!
et: Õnnitleme, sinu kaart on loodud!
fi: Onneksi olkoon! Uusi karttasi on luotu!

source: Map has been updated!
et: Kaart on uuendatud!
fi: Kartta on päivitetty!

source: Map editors updated with success!
et: Kaardi toimetajaid uuendati edukalt!
fi: Kartan toimittajat päivitetty onnistuneesti!

source: Only its owner can delete the map.
et: Kaarti saab kustutada vaid selle omanik.
fi: Vain kartan omistaja voi poistaa kartan.

source: Your map has been cloned! If you want to edit this map from another computer, please use this link: %(anonymous_url)s
et: Sinu kaart on kopeeritud! Kui sa soovid oma kaarti muuta teisest arvutist, kasuta palun seda linki: %(anonymous_url)s
fi: Karttasi on kloonattu! Jos haluat muokata tätä karttaa joltain muulta tietokoneelta, käytä tätä linkkiä: %(anonymous_url)s

source: Congratulations, your map has been cloned!
et: Sinu kaart on kopeeritud!
fi: Onneksi olkoon! Karttasi on kloonattu!

source: Layer successfully deleted.
et: Kiht on kustutatud.
fi: Kerros onnistuneesti poistettu. Pysyvästi.

source: Type editors nick to add…
fi: Kirjoita muokkaajan nimi lisätäksesi...

source: uMap let you create maps with <a href="%(osm_url)s" />OpenStreetMap</a> layers in a minute and embed them in your site.
fi: uMap mahdollistaa <a href="%(osm_url)s" />OpenStreetMap</a>-pohjaisten räätälöityjen karttojen luomisen ja liittämisen verkkosivuusi muutamassa minuutissa.

source: This is a demo instance, used for tests and pre-rolling releases. If you need a stable instance, please use <a href="%(stable_url)s">%(stable_url)s</a>. You can also host your own instance, it's <a href="%(repo_url)s">open source</a>!
fi: Tämä on uMapin demo-instanssi, jota käytetään testaamiseen ja väliversioille. Jos tarvitset vakaan version, niin käytäthän <a href="%(stable_url)s">%(stable_url)s</a> :a. Voit myös tarjota oman instanssin - <a href="%(repo_url)s">avoin lähdekoodi</a> rulettaa!

source: No licence set
fi: Määrittämätön lisenssi

source: URL template using OSM tile format
fi: OSM-karttatiiliformaattia mukaileva URL-sapluuna

source: Order of the tilelayers in the edit box
fi: Taustakarttojen järjestys muokkauslaatikossa

source: background
fi: tausta

source: Your anonymous map has been attached to your account %s
fi: Anonyymi karttasi on liitetty tiliisi %s

source: Map permissions
fi: Kartan oikeudet

source: Please log in to proceed
fi: Rekisteröidythän jatkaaksesi, jooko?

source: Your username and password didn't match. Please try again.
fi: Käyttäjätunnuksesi ja salasanasi eivät täsmänneet. Yritä uudestaan ole hyvä.
